---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Stairs.ActualTreadsNumber
zh: 楼梯
source: html/224855f5-eb2b-84bc-864a-a3819cdf855c.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.ActualTreadsNumber Property

**中文**: 楼梯

The number of treads actually created in the stairs.

## Syntax (C#)
```csharp
public int ActualTreadsNumber { get; }
```